<div class="alert alert-block alert-success">
    <h1 align="center">Pandas Trick 25</h1>
    <h3 align="center">Pivot in Pandas</h3>
    <h4 align="center"><a href="http://www.iran-machinelearning.ir">Soheil Tehranipour</a></h5>
</div>

### Importing the libraries

In [3]:
import numpy as np
import pandas as pd;
import matplotlib.pyplot as plt

In [2]:
pd.__version__

'1.5.1'

## Import Dataset & Make Dataframe

In [4]:
# lets read the dataset
data = pd.read_csv('employee.csv')

data.shape

(1470, 35)

In [5]:
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [6]:
# let's make a pivot table for the department and their mean ages

data.pivot_table(values ='Age', index = 'Department', aggfunc = 'mean')

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

In [7]:
# let's try making a pivot table for department and their maximum ages

data.pivot_table(values = 'Age', index = 'Department', aggfunc = 'max')

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

In [8]:
# let's try making a pivot table for department and their minimum ages

data.pivot_table(values = 'Age', index = 'Department', aggfunc = 'min')

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

In [9]:
# let's try making a pivot table for department and their median ages

data.pivot_table(values = 'Age', index = 'Department', aggfunc = 'median')

                        Age
Department
Human Resources          37
Research & Development   36
Sales                    35

In [10]:
# let's try making a pivot table with multi index
# Department and Education Field and check the maximum salary values of employees

data.pivot_table(values = ['MonthlyRate','DailyRate'],
                 index = ['Department','EducationField'],
                 aggfunc = 'max')

                                         DailyRate  MonthlyRate
Department             EducationField
Human Resources        Human Resources        1420        25811
                       Life Sciences          1383        26894
                       Medical                1398        25657
                       Other                  1444        12832
                       Technical Degree       1107        24017
Research & Development Life Sciences          1490        26968
                       Medical                1495        26999
                       Other                  1474        26537
                       Technical Degree       1496        26849
Sales                  Life Sciences          1498        26204
                       Marketing              1499        26959
                       Medical                1476        26997
                       Other                  1474        23914
                       Technical Degree       1496        25952

<img src="https://webna.ir/wp-content/uploads/2018/08/%D9%85%DA%A9%D8%AA%D8%A8-%D8%AE%D9%88%D9%86%D9%87.png" width=50% />